In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("c2_file.csv")

In [3]:
df

        a   b  c    d
0  yellow  10  2  3.2
1   green   2  3  8.1
2    blue   7  1  0.4

In [4]:
pd.read_csv("c2_file.csv", header=None)

        0   1  2    3
0       a   b  c    d
1  yellow  10  2  3.2
2   green   2  3  8.1
3    blue   7  1  0.4

In [5]:
pd.read_csv("c2_file.csv", names=["column 1", "column 2", "column 3", "column 4"])

  column 1 column 2 column 3 column 4
0        a        b        c        d
1   yellow       10        2      3.2
2    green        2        3      8.1
3     blue        7        1      0.4

In [6]:
pd.read_csv("c2_file.csv", index_col=0)

         b  c    d
a
yellow  10  2  3.2
green    2  3  8.1
blue     7  1  0.4

In [7]:
df.dtypes

a     object
b      int64
c      int64
d    float64
dtype: object

In [8]:
df

        a   b  c    d
0  yellow  10  2  3.2
1   green   2  3  8.1
2    blue   7  1  0.4

In [9]:
df2 = pd.read_csv("c2_file.csv", dtype={"b": np.float64})
df2.dtypes

a     object
b    float64
c      int64
d    float64
dtype: object

In [10]:
df2

        a     b  c    d
0  yellow  10.0  2  3.2
1   green   2.0  3  8.1
2    blue   7.0  1  0.4

In [11]:
pd.read_csv("c2_file.csv", usecols=["a", "b"])

        a   b
0  yellow  10
1   green   2
2    blue   7